Revit 2024 API
ViewDisplayBackground.Type Property
 The type of the background.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ViewDisplayBackgroundType Type { get; }
Visual Basic
Public ReadOnly Property Type As ViewDisplayBackgroundType
	Get
Visual C++
public:
property ViewDisplayBackgroundType Type {
	ViewDisplayBackgroundType get ();
}
See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace